CASE_II/Mesh4/system/topoSetDict_BG
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
	name	BG_active;
	type 	cellSet;
	action 	new;
	source	fieldToCell;
	field	zoneID;
	min	-0.1;
	max	0.1;

    }

    {
        name    BG_active;
        type    cellSet;
        action  subset;
        source  fieldToCell;
        field   cellTypes;
	min	-0.1;
	max	0.1;
    }

);


// ************************************************************************* //
